Table of Contents
 Class ResultsImportersConfiguration
Namespace
IdeaStatiCa.BimApiLink
Assembly
IdeaStatiCa.BimApiLink.dll
public sealed class ResultsImportersConfiguration
Inheritance
object
ResultsImportersConfiguration
Inherited Members
 object.ToString()
 object.Equals(object)
 object.Equals(object, object)
 object.ReferenceEquals(object, object)
 object.GetHashCode()
 object.GetType()
Properties
 ResultsProvider
public IBimResultsProvider ResultsProvider { get; }
Property Value
IBimResultsProvider
Methods
 RegisterImporter<T>(IInternalForcesImporter<T>)
public ResultsImportersConfiguration RegisterImporter<T>(IInternalForcesImporter<T> importer) where T : IIdeaObjectWithResults
Parameters
importer IInternalForcesImporter<T>
Returns
ResultsImportersConfiguration
Type Parameters
T
 Edit this page